org/psych_50_cognitive_neuroscience.org
:PROPERTIES:
:ID:       543215d5-6bd3-423c-98a9-8374b7e26894
:END:
#+TITLE: PSYCH 50: Cognitive Neuroscience

* Course Description:
How does our brain give rise to our abilities to perceive, act and think? Survey of the basic facts, empirical evidence, theories and methods of study in cognitive neuroscience exploring how cognition is instantiated in neural activity. Representative topics include perceptual and motor processes, decision making, learning and memory, attention, reward processing, reinforcement learning, sensory inference and cognitive control
* Learning goals
We are our brains. The overall goal of this class is to introduce you to the scientific study of how our brains work to make us who we are. This class should prepare you to take more specialized upper level classes in specific areas of cognitive neuroscience. 

After taking this course you should be able to...

...demonstrate familiarity with basic anatomy and physiology of the brain. You should gain familiarity with fundamental terminology and basic knowledge about brain systems and functions. You should be able to recognize and understand these terms when you encounter them in reading literature (both popular press and primary) or listening to lectures about cognitive neuroscience. Chapter reading and quizzes will be used to build this knowledge. Examples of basic factual knowledge:

What are neurons and glial cells? What functions do they preform?
What is an action potential? Why is it important for cognitive function? How do ionic currents make it possible?
Where is prefrontal cortex? What might happen to someone if they had damage to it?
What is dopamine? What it is thought to signal in the brain?

...explain how the brain allows us to do everyday behaviors. Cognitive neuroscience aims to provide explanations for how the brain gives rise to behavior. You should be able to take any behavior that you engage in like walking, talking or deciding whether to drink a cup of coffee or eat cheese and be able to discuss what might be going on inside the brain to allow you to preform that behavior. This is not just knowing what parts of the brain are involved in different functions, but being able to apply conceptual models derived from cognitive neuroscience to new situations. We will practice this through weekly thought questions discussed in section. For example: 

I decide to swing at a pitch while playing whiffle ball. How would a diffusion model explain my reaction time and choice?
I recognize someone I just met, but I can't remember their name. What are the processes in the brain that have and have not worked properly?
I slowly learn to balance on my new RipStik casterboard. How do I sense balance? Would reinforcement learning provide a good theory for how I have learned to do this? If so, what would my dopamine neurons be doing when I fall off the board?
* Topics 
We will not cover everything there is to know about cognitive neuroscience in one quarter. Cognitive neuroscience is a rich field that draws on many disciplines from biology, chemistry, psychology, computer science, engineering, mathematics, philosophy and beyond. The objective is not to be exhaustive (and exhausting!) in what we cover. Instead the goal is to give you basic background and conceptual knowledge as outlined above by going in to depth in a few areas to illustrate the concepts and knowledge that structure the scientific study of cognitive neuroscience. 
** Input 
 Our brains have many sensors and systems that allow us to get information about the outside world. For example, touch, smell, balance, etc. We will use the visual system as a canonical system for understanding how information about the world gets into the brain. This will allow us to understand what is meant by bottom-up processing from sensory transduction to cortical streams of processing supporting high-level categorization and sensory inference. 
** Output 
 We will next flip our thinking about the brain from something that passively takes in information and processes it to something that generates movement. 
** Feedback 
 If the brain can act to contract muscles and make movements it can also act on itself to [[id:afec4613-ac62-4e12-9e1d-70d71791e842][change]] things like sensory processing. We will discuss in depth a canonical system that does just that: attention.
 Broadcast We will next turn from cognitive processes like attention that offer very specific control of information processing to ones that can distribute information widely and modulate activity across lots of the brain; neuromodulatory systems. We will discuss in-depth the one we know the most about - the dopamine system and its role in reinforcement learning.
