html/psych_50_cognitive_neuroscience.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-30 Sat 04:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PSYCH 50: Cognitive Neuroscience</title>
<meta name="author" content="Ketan Agrawal" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="syntax.css" />
<link rel="stylesheet" type="text/css" href="styles.css" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png" />
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png" />
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png" />
<link rel="manifest" href="/site.webmanifest" />
</head>
<body>
<div id="preamble" class="status">
<header>
    <script src="setup-initial-theme.js"></script>
    <div style="display: flex; flex-direction: row; justify-content: space-between; align-items: center;">
        <a style="color: inherit; text-decoration: none" href="/">
            <svg id="nebula-logo" x="0px" y="0px" width="50px"
                 viewBox="0 0 290.513 290.513" style="enable-background:new 0 0 290.513 290.513;" xml:space="preserve">
                <g>
                    <g>
                        <path d="M168.684,103.086c-58.679,0-93.713,17.515-93.713,46.857c0,18.344,27.214,28.114,46.857,28.114
                                 c46.327,0,46.857-22.472,46.857-23.428l-9.367-0.141c-0.009,0.141-1.354,14.198-37.49,14.198
                                 c-16.976,0-37.485-8.359-37.485-18.743c0-23.124,32.317-37.485,84.342-37.485c68.312,0,112.456,20.233,112.456,51.542
                                 c0,32.818-50.989,70.252-145.49,74.975l0.469,9.357c101.36-5.065,154.393-46.262,154.393-84.333
                                 C290.511,126.996,242.689,103.086,168.684,103.086z"/>
                        <path d="M215.541,154.628c0-18.344-27.214-28.114-46.857-28.114c-46.327,0-46.857,22.472-46.857,23.428
                                 l9.367,0.141c0.009-0.141,1.354-14.198,37.49-14.198c16.976,0,37.485,8.359,37.485,18.743c0,23.124-32.317,37.485-84.342,37.485
                                 c-68.312,0-112.456-20.233-112.456-51.542c0-32.818,50.989-70.252,145.49-74.975l-0.469-9.357C53.032,61.303,0,102.5,0,140.571
                                 c0,37.003,47.822,60.914,121.827,60.914C180.506,201.485,215.541,183.97,215.541,154.628z"/>
                        <path d="M51.542,107.771c0,7.75-6.307,14.057-14.057,14.057v9.371c7.75,0,14.057,6.307,14.057,14.057h9.371
                                 c0-7.75,6.307-14.057,14.057-14.057v-9.371c-7.75,0-14.057-6.307-14.057-14.057H51.542z M56.228,131.214
                                 c-1.335-1.776-2.919-3.364-4.7-4.7c1.781-1.335,3.364-2.924,4.7-4.7c1.335,1.776,2.919,3.364,4.7,4.7
                                 C59.147,127.849,57.563,129.438,56.228,131.214z"/>
                        <path d="M238.969,187.428h9.371c0-10.337,8.406-18.743,18.743-18.743v-9.371
                                 c-10.337,0-18.743-8.406-18.743-18.743h-9.371c0,10.337-8.406,18.743-18.743,18.743v9.371
                                 C230.563,168.685,238.969,177.091,238.969,187.428z M243.655,156.095c2.08,3.13,4.775,5.82,7.905,7.905
                                 c-3.13,2.08-5.82,4.775-7.905,7.905c-2.08-3.13-4.775-5.82-7.905-7.905C238.88,161.919,241.574,159.225,243.655,156.095z"/>
                        <path d="M103.085,206.17h-9.371c0,10.337-8.406,18.743-18.743,18.743v9.371
                                 c10.337,0,18.743,8.406,18.743,18.743h9.371c0-10.337,8.406-18.743,18.743-18.743v-9.371
                                 C111.491,224.913,103.085,216.507,103.085,206.17z M98.399,237.503c-2.08-3.13-4.775-5.82-7.905-7.905
                                 c3.13-2.08,5.82-4.775,7.905-7.905c2.08,3.13,4.775,5.82,7.905,7.905C103.174,231.679,100.479,234.373,98.399,237.503z"/>
                        <path d="M182.741,84.343h9.371c0-10.337,8.406-18.743,18.743-18.743v-9.371
                                 c-10.337,0-18.743-8.406-18.743-18.743h-9.371c0,10.337-8.406,18.743-18.743,18.743V65.6
                                 C174.335,65.6,182.741,74.006,182.741,84.343z M187.427,53.01c2.08,3.13,4.775,5.82,7.905,7.905
                                 c-3.13,2.08-5.82,4.775-7.905,7.905c-2.08-3.13-4.775-5.82-7.905-7.905C182.652,58.834,185.346,56.14,187.427,53.01z"/>
                        <rect x="98.399" y="135.885" width="9.371" height="9.371"/>
                        <rect x="107.77" y="149.942" width="9.371" height="9.371"/>
                        <rect x="168.684" y="168.685" width="9.371" height="9.371"/>
                        <rect x="182.741" y="145.257" width="9.371" height="9.371"/>
		                    <rect x="215.541" y="187.428" width="9.371" height="9.371"/>
		                    <rect x="154.627" y="215.542" width="9.371" height="9.371"/>
	                  </g>
                </g>
            </svg>
        </a>
        <div>
            <input type="checkbox" id="theme-switcher">
            <label id="theme-switcher-label" for="theme-switcher"></label>
        </div>
    </div>
</header>
</div>
<div id="content" class="content">
<h1 class="title">PSYCH 50: Cognitive Neuroscience
<br />
<span class="subtitle">Last modified on April 30, 2022</span>
</h1>

<div id="outline-container-orga216c74" class="outline-2">
<h2 id="orga216c74">Course Description:</h2>
<div class="outline-text-2" id="text-orga216c74">
<p>
How does our brain give rise to our abilities to perceive, act and think? Survey of the basic facts, empirical evidence, theories and methods of study in cognitive neuroscience exploring how cognition is instantiated in neural activity. Representative topics include perceptual and motor processes, decision making, learning and memory, attention, reward processing, reinforcement learning, sensory inference and cognitive control<br />
</p>
</div>
</div>
<div id="outline-container-org7097298" class="outline-2">
<h2 id="org7097298">Learning goals</h2>
<div class="outline-text-2" id="text-org7097298">
<p>
We are our brains. The overall goal of this class is to introduce you to the scientific study of how our brains work to make us who we are. This class should prepare you to take more specialized upper level classes in specific areas of cognitive neuroscience.<br />
</p>

<p>
After taking this course you should be able to&#x2026;<br />
</p>

<p>
&#x2026;demonstrate familiarity with basic anatomy and physiology of the brain. You should gain familiarity with fundamental terminology and basic knowledge about brain systems and functions. You should be able to recognize and understand these terms when you encounter them in reading literature (both popular press and primary) or listening to lectures about cognitive neuroscience. Chapter reading and quizzes will be used to build this knowledge. Examples of basic factual knowledge:<br />
</p>

<p>
What are neurons and glial cells? What functions do they preform?<br />
What is an action potential? Why is it important for cognitive function? How do ionic currents make it possible?<br />
Where is prefrontal cortex? What might happen to someone if they had damage to it?<br />
What is dopamine? What it is thought to signal in the brain?<br />
</p>

<p>
&#x2026;explain how the brain allows us to do everyday behaviors. Cognitive neuroscience aims to provide explanations for how the brain gives rise to behavior. You should be able to take any behavior that you engage in like walking, talking or deciding whether to drink a cup of coffee or eat cheese and be able to discuss what might be going on inside the brain to allow you to preform that behavior. This is not just knowing what parts of the brain are involved in different functions, but being able to apply conceptual models derived from cognitive neuroscience to new situations. We will practice this through weekly thought questions discussed in section. For example:<br />
</p>

<p>
I decide to swing at a pitch while playing whiffle ball. How would a diffusion model explain my reaction time and choice?<br />
I recognize someone I just met, but I can&rsquo;t remember their name. What are the processes in the brain that have and have not worked properly?<br />
I slowly learn to balance on my new RipStik casterboard. How do I sense balance? Would reinforcement learning provide a good theory for how I have learned to do this? If so, what would my dopamine neurons be doing when I fall off the board?<br />
</p>
</div>
</div>
<div id="outline-container-org3aba5f1" class="outline-2">
<h2 id="org3aba5f1">Topics</h2>
<div class="outline-text-2" id="text-org3aba5f1">
<p>
We will not cover everything there is to know about cognitive neuroscience in one quarter. Cognitive neuroscience is a rich field that draws on many disciplines from biology, chemistry, psychology, computer science, engineering, mathematics, philosophy and beyond. The objective is not to be exhaustive (and exhausting!) in what we cover. Instead the goal is to give you basic background and conceptual knowledge as outlined above by going in to depth in a few areas to illustrate the concepts and knowledge that structure the scientific study of cognitive neuroscience.<br />
</p>
</div>
<div id="outline-container-org354c76d" class="outline-3">
<h3 id="org354c76d">Input</h3>
<div class="outline-text-3" id="text-org354c76d">
<p>
Our brains have many sensors and systems that allow us to get information about the outside world. For example, touch, smell, balance, etc. We will use the visual system as a canonical system for understanding how information about the world gets into the brain. This will allow us to understand what is meant by bottom-up processing from sensory transduction to cortical streams of processing supporting high-level categorization and sensory inference.<br />
</p>
</div>
</div>
<div id="outline-container-orgc220700" class="outline-3">
<h3 id="orgc220700">Output</h3>
<div class="outline-text-3" id="text-orgc220700">
<p>
We will next flip our thinking about the brain from something that passively takes in information and processes it to something that generates movement.<br />
</p>
</div>
</div>
<div id="outline-container-org9718cb8" class="outline-3">
<h3 id="org9718cb8">Feedback</h3>
<div class="outline-text-3" id="text-org9718cb8">
<p>
If the brain can act to contract muscles and make movements it can also act on itself to <a href="private/20200328053448-change.html#ID-afec4613-ac62-4e12-9e1d-70d71791e842">change</a> things like sensory processing. We will discuss in depth a canonical system that does just that: attention.<br />
Broadcast We will next turn from cognitive processes like attention that offer very specific control of information processing to ones that can distribute information widely and modulate activity across lots of the brain; neuromodulatory systems. We will discuss in-depth the one we know the most about - the dopamine system and its role in reinforcement learning.<br />
</p>
</div>
</div>
