org/psych_50_cognitive_neuroscience.org
** Memory 
 Memory will give us a chance to see many of the above concepts put together to explain a cognitive function. It will also show us how neuroscience can inform our understanding of cognition as we see different systems and process underlie different forms of memory.
 Along the way, various topics will come up - emotion, language, decision-making, consciousness, free-will, psychoactive drugs, disease, mental illness, brain metabolism, brain-machine interfaces, mind-control - we will try to fit these into the above frameworks for thinking about the brain. Undoubtedly, there will be a part of cognitive functioning that we do not cover (hey, why haven’t we talked about why I sneeze when I see a bright light? - you are wired funny. Yes, that’s true. It really happens). You will have opportunities in sections to take the framework that are discussed in lectures and apply them to understanding other things that were not covered. So, for example, in section we might talk about somatosensory or olfactory systems and how they are the same or different from the visual system. 
** Ethics and morality
 Some aspects of the material covered in a cognitive neuroscience course may bring up ethical and moral considerations for you that you feel strongly about. For instance, it might challenge your religious beliefs. It might challenge notions of when someone should be culpable for behavior that is abhorrent but for which they might not have control. They may challenge your notions of self, of memory, of personality. All these are extremely important issues since they bear on how we act as a society, how we educate, how we deal with crime and punishment, how we think about who we are and how we act with others. Much foundational work in cognitive science has been done using animal experiments which raise important questions of how we weight humane treatment of animals against the quest for knowledge and betterment of human society and health. 

 We encourage you all to think about these issues openly and frankly as they should be in an academic environment like Stanford. Having said that, we hope that you will come in with as open a mind as possible and not pre-judge what you are learning about. We will have opportunities in sections at the beginning and end of the quarter to discuss issues related to ethical and moral considerations that come out of the study of cognitive neuroscience.
* Intro
:PROPERTIES:
:ID:       1510d124-c70c-4f76-b956-2819316e7df6
:END:
/How does our brain allow us to do what we do?/ -- that is, cognitive neuroscience = how cognition is /implemented/ in the brain, whereas cognitive science = how we think and behave.

[[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 1 Study Guide_ Introduction to Cognitive Neuroscience.pdf::3++0.00;;annot-3-0][different "scales" of the same system]] -- genes => intracellular signals => neurotransmitters/receptors => synapses => neurons => local circuits => populations => areas => interacting brains

different processes: input · output · feedback · broadcast

Key framework: [[id:bad51535-4aad-4e2a-b6e5-fff9839e9224][Marr's Levels]]. What goal? What algorithm? What implementation? -- interesting bit from Marr here. We can't study the brain just by looking at neuron implementation -- we need to ask what they're trying to accomplish, and how.

Experiment types: observe brain, add something to brain, remove something from brain. observe is cheaper, but add/remove can establish causality (since you're essentially doing the "wiggle" test.) So, when FB/Twitter/whatever do A/B testing, they're basically doing add/remove (psych not neuro) experiments lol...
* Hierarchical processing
Visual cortex is the cleanest example of hierarchical processing. Can draw an analogy to [[id:ff35bb26-6dde-42cd-988c-1c05e13b707f][convolutional neural networks]] in the building up of increasingly complex representations in deeper layers.

LGN => V1: go [[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 1 Study Guide_ Introduction to Cognitive Neuroscience.pdf::13++0.00][from circular receptive fields to orientation-selective receptive fields]] (in one synapse!) by just overlaying the circular receptive fields.

V1 simple => V1 complex: similar idea. V1 complex are still orientation-selective, but now position invariant.

(side note, laterality: representations switch sides)

And so on, V2 => V4 ... unlike convnets, though, not all the connections are feedforward. Some go back to previous layers. What do those do, I wonder?
* Dorsal Visual Pathway
"where" / action stream
* Ventral Visual Pathway
:PROPERTIES:
:ID:       dd8e3fad-db3f-4fee-9dd9-cca026ceeadd
:END:
"what" / perception stream

Vision isn't just about copying the pattern of light in the eyes -- it's about making *meaning* out of that. That semantic meaning isn't at the level of neurons -- i.e. no "grandmother cell" specifically for grandma, but rather a distributed representation. (Ok fine they found this one neuron that's dedicated to Jennifer Aniston LOL, but it def wouldn't be the only/encapsulating neuron for Aniston representation)

Fusiform Face Area (FFA) -- area of ventral cortex that is specifically selective to faces. (Observe: seeing face <=> FFA activity, Add: stimulation leads to distorted perception, Remove: loss of FFA causes prosopagnosia, inability to recognize faces)

* Perceptual Decision Making
Middle Temporal: needed for motion detection (Remove: lesioning [[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 2 Study Guide_ Introduction to Cognitive Neuroscience.pdf::13++0.00][flattens psychometric curve]].) We have "integrator neurons" that [[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 2 Study Guide_ Introduction to Cognitive Neuroscience.pdf::20++0.00][sum up the responses from leftward-motion and rightward-motion neurons, and once a threshold is crossed either way make a decision]].
* Action Potential
[[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 3 Study Guide_ Introduction to Cognitive Neuroscience.pdf::10++0.00][Chemical basis]]: /resting membrane potential/ is increased by synaptic input from another neuron above threshold potential => Na+ channels open + Na+ enters and depolarizes cell (spike up), Na+ channels close, K+ channels open + K+ leaves cell (spike down), Na+/K+ pump uses ATP to restore resting potential

Myelination + axon width => Action potentials vary in speed in different brain regions (!)
