html/psych_50_cognitive_neuroscience.html
<div id="outline-container-orgd4ba31e" class="outline-3">
<h3 id="orgd4ba31e">Memory</h3>
<div class="outline-text-3" id="text-orgd4ba31e">
<p>
Memory will give us a chance to see many of the above concepts put together to explain a cognitive function. It will also show us how neuroscience can inform our understanding of cognition as we see different systems and process underlie different forms of memory.<br />
Along the way, various topics will come up - emotion, language, decision-making, consciousness, free-will, psychoactive drugs, disease, mental illness, brain metabolism, brain-machine interfaces, mind-control - we will try to fit these into the above frameworks for thinking about the brain. Undoubtedly, there will be a part of cognitive functioning that we do not cover (hey, why haven’t we talked about why I sneeze when I see a bright light? - you are wired funny. Yes, that’s true. It really happens). You will have opportunities in sections to take the framework that are discussed in lectures and apply them to understanding other things that were not covered. So, for example, in section we might talk about somatosensory or olfactory systems and how they are the same or different from the visual system.<br />
</p>
</div>
</div>
<div id="outline-container-org4f06b1f" class="outline-3">
<h3 id="org4f06b1f">Ethics and morality</h3>
<div class="outline-text-3" id="text-org4f06b1f">
<p>
Some aspects of the material covered in a cognitive neuroscience course may bring up ethical and moral considerations for you that you feel strongly about. For instance, it might challenge your religious beliefs. It might challenge notions of when someone should be culpable for behavior that is abhorrent but for which they might not have control. They may challenge your notions of self, of memory, of personality. All these are extremely important issues since they bear on how we act as a society, how we educate, how we deal with crime and punishment, how we think about who we are and how we act with others. Much foundational work in cognitive science has been done using animal experiments which raise important questions of how we weight humane treatment of animals against the quest for knowledge and betterment of human society and health.<br />
</p>

<p>
We encourage you all to think about these issues openly and frankly as they should be in an academic environment like Stanford. Having said that, we hope that you will come in with as open a mind as possible and not pre-judge what you are learning about. We will have opportunities in sections at the beginning and end of the quarter to discuss issues related to ethical and moral considerations that come out of the study of cognitive neuroscience.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-ID-1510d124-c70c-4f76-b956-2819316e7df6" class="outline-2">
<h2 id="ID-1510d124-c70c-4f76-b956-2819316e7df6">Intro</h2>
<div class="outline-text-2" id="text-org4c51ea4">
<p>
<i>How does our brain allow us to do what we do?</i> &#x2013; that is, cognitive neuroscience = how cognition is <i>implemented</i> in the brain, whereas cognitive science = how we think and behave.<br />
</p>

<p>
<a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 1 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=3">different &ldquo;scales&rdquo; of the same system</a> &#x2013; genes =&gt; intracellular signals =&gt; neurotransmitters/receptors =&gt; synapses =&gt; neurons =&gt; local circuits =&gt; populations =&gt; areas =&gt; interacting brains<br />
</p>

<p>
different processes: input · output · feedback · broadcast<br />
</p>

<p>
Key framework: <a href="private/marrslevels.html#ID-bad51535-4aad-4e2a-b6e5-fff9839e9224">Marr&rsquo;s Levels</a>. What goal? What algorithm? What implementation? &#x2013; interesting bit from Marr here. We can&rsquo;t study the brain just by looking at neuron implementation &#x2013; we need to ask what they&rsquo;re trying to accomplish, and how.<br />
</p>

<p>
Experiment types: observe brain, add something to brain, remove something from brain. observe is cheaper, but add/remove can establish causality (since you&rsquo;re essentially doing the &ldquo;wiggle&rdquo; test.) So, when FB/Twitter/whatever do A/B testing, they&rsquo;re basically doing add/remove (psych not neuro) experiments lol&#x2026;<br />
</p>
</div>
</div>
<div id="outline-container-orga737aaf" class="outline-2">
<h2 id="orga737aaf">Hierarchical processing</h2>
<div class="outline-text-2" id="text-orga737aaf">
<p>
Visual cortex is the cleanest example of hierarchical processing. Can draw an analogy to <a href="private/20200924211448-convolutional_neural_networks.html#ID-ff35bb26-6dde-42cd-988c-1c05e13b707f">convolutional neural networks</a> in the building up of increasingly complex representations in deeper layers.<br />
</p>

<p>
LGN =&gt; V1: go <a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 1 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=13">from circular receptive fields to orientation-selective receptive fields</a> (in one synapse!) by just overlaying the circular receptive fields.<br />
</p>

<p>
V1 simple =&gt; V1 complex: similar idea. V1 complex are still orientation-selective, but now position invariant.<br />
</p>

<p>
(side note, laterality: representations switch sides)<br />
</p>

<p>
And so on, V2 =&gt; V4 &#x2026; unlike convnets, though, not all the connections are feedforward. Some go back to previous layers. What do those do, I wonder?<br />
</p>
</div>
</div>
<div id="outline-container-org269734d" class="outline-2">
<h2 id="org269734d">Dorsal Visual Pathway</h2>
<div class="outline-text-2" id="text-org269734d">
<p>
&ldquo;where&rdquo; / action stream<br />
</p>
</div>
</div>
<div id="outline-container-ID-dd8e3fad-db3f-4fee-9dd9-cca026ceeadd" class="outline-2">
<h2 id="ID-dd8e3fad-db3f-4fee-9dd9-cca026ceeadd">Ventral Visual Pathway</h2>
<div class="outline-text-2" id="text-orgb0bf788">
<p>
&ldquo;what&rdquo; / perception stream<br />
</p>

<p>
Vision isn&rsquo;t just about copying the pattern of light in the eyes &#x2013; it&rsquo;s about making <b>meaning</b> out of that. That semantic meaning isn&rsquo;t at the level of neurons &#x2013; i.e. no &ldquo;grandmother cell&rdquo; specifically for grandma, but rather a distributed representation. (Ok fine they found this one neuron that&rsquo;s dedicated to Jennifer Aniston LOL, but it def wouldn&rsquo;t be the only/encapsulating neuron for Aniston representation)<br />
</p>

<p>
Fusiform Face Area (FFA) &#x2013; area of ventral cortex that is specifically selective to faces. (Observe: seeing face &lt;=&gt; FFA activity, Add: stimulation leads to distorted perception, Remove: loss of FFA causes prosopagnosia, inability to recognize faces)<br />
</p>
</div>
</div>

<div id="outline-container-org86ed415" class="outline-2">
<h2 id="org86ed415">Perceptual Decision Making</h2>
<div class="outline-text-2" id="text-org86ed415">
<p>
Middle Temporal: needed for motion detection (Remove: lesioning <a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 2 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=13">flattens psychometric curve</a>.) We have &ldquo;integrator neurons&rdquo; that <a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 2 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=20">sum up the responses from leftward-motion and rightward-motion neurons, and once a threshold is crossed either way make a decision</a>.<br />
</p>
</div>
</div>
<div id="outline-container-org2019e45" class="outline-2">
<h2 id="org2019e45">Action Potential</h2>
<div class="outline-text-2" id="text-org2019e45">
<p>
<a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 3 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=10">Chemical basis</a>: <i>resting membrane potential</i> is increased by synaptic input from another neuron above threshold potential =&gt; Na+ channels open + Na+ enters and depolarizes cell (spike up), Na+ channels close, K+ channels open + K+ leaves cell (spike down), Na+/K+ pump uses ATP to restore resting potential<br />
</p>

<p>
Myelination + axon width =&gt; Action potentials vary in speed in different brain regions (!)<br />
</p>
</div>
</div>
