org/psych_50_cognitive_neuroscience.org
* Motor Systems
Why do we have a brain? Simple (evolutionarily): to move. Motion is incredibly complex

This is a pretty interesting thing to think about. Like yes, we have brains to think and plan and all that super intelligent human stuff -- but ultimately all that doesn't really mean anything unless it eventually translates into motor movement (and especially motor movement that leads to viable reproduction LOL.)

[[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 3 Study Guide_ Introduction to Cognitive Neuroscience.pdf::15++0.00][Central pattern generator]] in brainstem/spine can generate rhythmic movements (like walking) with /no cortical input/(!!) -- cortex just flips them on/off like a light switch.

Basal ganglia = gateway, timing, value

Premotor and supplementary motor areas: Planning, movement sequences.

Cerebellum = learning + error correction

Motor cortex = Volitional control. shaped like [[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 3 Study Guide_ Introduction to Cognitive Neuroscience.pdf::19++0.00][homunculus]]. This is too simplistic though -- some stimulations generate complex movements with many muscles..
* Energetics
How does the brain use energy? + vasculature that supports it

Brain uses a LOT of energy relative to rest of body...yet compared to computers are extremely efficient 😅.

Can measure BOLD (Blood Oxygen use) as a proxy for brain activity => basis for fMRI.
* Executive Control
:PROPERTIES:
:ID:       fefd433d-cc4d-4d5b-9a54-2412b6452b92
:END:
Frontal cortex = higher order thinking. Oh god, no lobotomies plz.

Frontal plays a role in /executive control/ -- what are we doing, what rules are we following, etc. Prefrontal cortex might play a role in category judgment.

Possibly a hierarchy of policy abstraction in PFC (i.e., goals on goals on goals.) Makes me wonder tho...cuz at some point in the hierarchy, at least for me, I don't feel like I have the highest-level goals in active memory. Like, they might be stored somewhere, but policy here feels more like "in the moment"...

These stories are vague / simplistic. We really don't know what the hell's going on in the PFC. => level of abstraction that's useful here is /populations/ of neurons performing cognitive functions. Looking at a neuron is like looking at a transistor.
* Attention
*overt* attention: you physically move your eyes (or other sensors) to pay attention
*covert* attention: the attention shift is only mental, not physical (i.e. looking out of the corner of your eyes)

Posner cueing task: Give a cue that's supposed to tell you where the stimulus appears. RTs are faster when the cue is valid, i.e. in the same direction as the stimulus.

Weber -- ability to notice small differences is increased when the cue is valid, as opposed to when the cue is neutral.

Biased competition model -- this one is interesting. Attention /suppresses/ the representation of the things you are not attending to. As if the stimuli are competing for representation, but attention biases the race.

Response gain / sensitivity enhancement -- /improvement/ in the representation due to attention.

Control of Attention: interesting observation is that world "stays stationary" when moving eyes. Hypothesis: whenever you move, an "efference copy" of the command is sent to the visual system to update your representation of the world. Hemholtz did a crazy experiment to test -- paralyzed himself and tried to move his eyes...indeed, he experienced shifting perception.

Frontal Eye Field (FEF): Responsible for voluntary saccades, fires for visual receptive field and motor fields -- but also "delay period" activity...involved in shifting attention / carrying cognitive signals related to working memory. Stimulating monkeys in FEF leads to overt (and at lower levels, covert) attention shift.

So what about the other senses, though? Is there a "Frontal ear field" or something? Cuz sometimes when listening to a podcast or something, I'm totally transfixed on the audio, barely even noticing / suppressing the visual stimuli around me.
* [[id:3e283aac-0cb5-4e06-b8ab-a742cff41a96][Plasticity]]
:PROPERTIES:
:ID:       246f1a64-9247-43da-b8ca-f5fb06c2eb5c
:END:
** The brain dynamically reorganizes to match its inputs
If you're blind, visual cortex gets taken over. If you're an amputee, the "arm" part of the somatosensory cortex gets taken over.
** The brain distributes resources based on relevance
What are you /using/? Available resources are dynamically allocated to that. Brain damage? The map just shrinks to the remaining territory (provided it's not /too/ bad). Add an extra eye to a frog? The optic tectum territory gets divided and some is given to the new eye.
** The brain has a "sensitive period" in early childhood = extreme plasticity -- some preprogrammed stuff, but a lot is "hooks" that are reliant on experience
It needs (social) input to shape it during that critical period, otherwise you got some feral children on your hands...
** previous points => brain can accomodate new input streams.
Cue the tongue cameras and magneto belts and sound => colors and stuff like that.
* [[id:4fba6fb0-e9cc-48b1-875c-a70e1a2dbc9b][Consciousness]]
:PROPERTIES:
:ID:       9cf77233-0337-49d0-82a0-e9072da807bc
:END:
Feels like...we're going with a neuroscientist's definition of consciousness here. One that presupposes Identity Theory...

I think he tried to apply the [[id:bad51535-4aad-4e2a-b6e5-fff9839e9224][Marr's Levels]] construct here -- top points are the physical / algorithmic ways consciousness happens, bottom is big picture, what's the purpose of consciousness?
** [[https://vimeo.com/254775987][Being Conscious with Bill Newsome on Vimeo]]
Oooohhh, the "consciousness ==> freedom" frame is powerful. Serious Tim Urban / Religion for the Nonreligious vibes. Being conscious / aware of the fog is the first step in getting rid of it.
** [[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/12consciousness.pdf::12++0.00][Consciousness is /constructed/]]
from the intention to move, the illusion of movement, the actual movement, movement => proprioceptive feedback, movement => sensory input -- each of these has an associated brain area
** Consciousness is unified
Despite all these different processes, we feel it like one, unified /experience/. Corpus callosum: connects our two hemispheres. Other connections exist, tho, and if corpus callosum is cut, anterior and posterior commisures show larger volume
