html/psych_50_cognitive_neuroscience.html
<div id="outline-container-org87ece39" class="outline-2">
<h2 id="org87ece39">Motor Systems</h2>
<div class="outline-text-2" id="text-org87ece39">
<p>
Why do we have a brain? Simple (evolutionarily): to move. Motion is incredibly complex<br />
</p>

<p>
This is a pretty interesting thing to think about. Like yes, we have brains to think and plan and all that super intelligent human stuff &#x2013; but ultimately all that doesn&rsquo;t really mean anything unless it eventually translates into motor movement (and especially motor movement that leads to viable reproduction LOL.)<br />
</p>

<p>
<a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 3 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=15">Central pattern generator</a> in brainstem/spine can generate rhythmic movements (like walking) with /no cortical input/(!!) &#x2013; cortex just flips them on/off like a light switch.<br />
</p>

<p>
Basal ganglia = gateway, timing, value<br />
</p>

<p>
Premotor and supplementary motor areas: Planning, movement sequences.<br />
</p>

<p>
Cerebellum = learning + error correction<br />
</p>

<p>
Motor cortex = Volitional control. shaped like <a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 3 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=19">homunculus</a>. This is too simplistic though &#x2013; some stimulations generate complex movements with many muscles..<br />
</p>
</div>
</div>
<div id="outline-container-orgc0cd188" class="outline-2">
<h2 id="orgc0cd188">Energetics</h2>
<div class="outline-text-2" id="text-orgc0cd188">
<p>
How does the brain use energy? + vasculature that supports it<br />
</p>

<p>
Brain uses a LOT of energy relative to rest of body&#x2026;yet compared to computers are extremely efficient 😅.<br />
</p>

<p>
Can measure BOLD (Blood Oxygen use) as a proxy for brain activity =&gt; basis for fMRI.<br />
</p>
</div>
</div>
<div id="outline-container-ID-fefd433d-cc4d-4d5b-9a54-2412b6452b92" class="outline-2">
<h2 id="ID-fefd433d-cc4d-4d5b-9a54-2412b6452b92">Executive Control</h2>
<div class="outline-text-2" id="text-orgee0f598">
<p>
Frontal cortex = higher order thinking. Oh god, no lobotomies plz.<br />
</p>

<p>
Frontal plays a role in <i>executive control</i> &#x2013; what are we doing, what rules are we following, etc. Prefrontal cortex might play a role in category judgment.<br />
</p>

<p>
Possibly a hierarchy of policy abstraction in PFC (i.e., goals on goals on goals.) Makes me wonder tho&#x2026;cuz at some point in the hierarchy, at least for me, I don&rsquo;t feel like I have the highest-level goals in active memory. Like, they might be stored somewhere, but policy here feels more like &ldquo;in the moment&rdquo;&#x2026;<br />
</p>

<p>
These stories are vague / simplistic. We really don&rsquo;t know what the hell&rsquo;s going on in the PFC. =&gt; level of abstraction that&rsquo;s useful here is <i>populations</i> of neurons performing cognitive functions. Looking at a neuron is like looking at a transistor.<br />
</p>
</div>
</div>
<div id="outline-container-orgdb4616d" class="outline-2">
<h2 id="orgdb4616d">Attention</h2>
<div class="outline-text-2" id="text-orgdb4616d">
<p>
<b>overt</b> attention: you physically move your eyes (or other sensors) to pay attention<br />
<b>covert</b> attention: the attention shift is only mental, not physical (i.e. looking out of the corner of your eyes)<br />
</p>

<p>
Posner cueing task: Give a cue that&rsquo;s supposed to tell you where the stimulus appears. RTs are faster when the cue is valid, i.e. in the same direction as the stimulus.<br />
</p>

<p>
Weber &#x2013; ability to notice small differences is increased when the cue is valid, as opposed to when the cue is neutral.<br />
</p>

<p>
Biased competition model &#x2013; this one is interesting. Attention <i>suppresses</i> the representation of the things you are not attending to. As if the stimuli are competing for representation, but attention biases the race.<br />
</p>

<p>
Response gain / sensitivity enhancement &#x2013; <i>improvement</i> in the representation due to attention.<br />
</p>

<p>
Control of Attention: interesting observation is that world &ldquo;stays stationary&rdquo; when moving eyes. Hypothesis: whenever you move, an &ldquo;efference copy&rdquo; of the command is sent to the visual system to update your representation of the world. Hemholtz did a crazy experiment to test &#x2013; paralyzed himself and tried to move his eyes&#x2026;indeed, he experienced shifting perception.<br />
</p>

<p>
Frontal Eye Field (FEF): Responsible for voluntary saccades, fires for visual receptive field and motor fields &#x2013; but also &ldquo;delay period&rdquo; activity&#x2026;involved in shifting attention / carrying cognitive signals related to working memory. Stimulating monkeys in FEF leads to overt (and at lower levels, covert) attention shift.<br />
</p>

<p>
So what about the other senses, though? Is there a &ldquo;Frontal ear field&rdquo; or something? Cuz sometimes when listening to a podcast or something, I&rsquo;m totally transfixed on the audio, barely even noticing / suppressing the visual stimuli around me.<br />
</p>
</div>
</div>
<div id="outline-container-ID-246f1a64-9247-43da-b8ca-f5fb06c2eb5c" class="outline-2">
<h2 id="ID-246f1a64-9247-43da-b8ca-f5fb06c2eb5c"><a href="private/20201001131603-plasticity.html#ID-3e283aac-0cb5-4e06-b8ab-a742cff41a96">Plasticity</a></h2>
<div class="outline-text-2" id="text-org7a7af85">
</div>
<div id="outline-container-orge221a8e" class="outline-3">
<h3 id="orge221a8e">The brain dynamically reorganizes to match its inputs</h3>
<div class="outline-text-3" id="text-orge221a8e">
<p>
If you&rsquo;re blind, visual cortex gets taken over. If you&rsquo;re an amputee, the &ldquo;arm&rdquo; part of the somatosensory cortex gets taken over.<br />
</p>
</div>
</div>
<div id="outline-container-org0ebc86e" class="outline-3">
<h3 id="org0ebc86e">The brain distributes resources based on relevance</h3>
<div class="outline-text-3" id="text-org0ebc86e">
<p>
What are you <i>using</i>? Available resources are dynamically allocated to that. Brain damage? The map just shrinks to the remaining territory (provided it&rsquo;s not <i>too</i> bad). Add an extra eye to a frog? The optic tectum territory gets divided and some is given to the new eye.<br />
</p>
</div>
</div>
<div id="outline-container-orgdd04fd6" class="outline-3">
<h3 id="orgdd04fd6">The brain has a &ldquo;sensitive period&rdquo; in early childhood = extreme plasticity &#x2013; some preprogrammed stuff, but a lot is &ldquo;hooks&rdquo; that are reliant on experience</h3>
<div class="outline-text-3" id="text-orgdd04fd6">
<p>
It needs (social) input to shape it during that critical period, otherwise you got some feral children on your hands&#x2026;<br />
</p>
</div>
</div>
<div id="outline-container-org6f84978" class="outline-3">
<h3 id="org6f84978">previous points =&gt; brain can accomodate new input streams.</h3>
<div class="outline-text-3" id="text-org6f84978">
<p>
Cue the tongue cameras and magneto belts and sound =&gt; colors and stuff like that.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-ID-9cf77233-0337-49d0-82a0-e9072da807bc" class="outline-2">
<h2 id="ID-9cf77233-0337-49d0-82a0-e9072da807bc"><a href="consciousness.html#ID-4fba6fb0-e9cc-48b1-875c-a70e1a2dbc9b">Consciousness</a></h2>
<div class="outline-text-2" id="text-org04711ea">
<p>
Feels like&#x2026;we&rsquo;re going with a neuroscientist&rsquo;s definition of consciousness here. One that presupposes Identity Theory&#x2026;<br />
</p>

<p>
I think he tried to apply the <a href="private/marrslevels.html#ID-bad51535-4aad-4e2a-b6e5-fff9839e9224">Marr&rsquo;s Levels</a> construct here &#x2013; top points are the physical / algorithmic ways consciousness happens, bottom is big picture, what&rsquo;s the purpose of consciousness?<br />
</p>
</div>
<div id="outline-container-org9664160" class="outline-3">
<h3 id="org9664160"><a href="https://vimeo.com/254775987">Being Conscious with Bill Newsome on Vimeo</a></h3>
<div class="outline-text-3" id="text-org9664160">
<p>
Oooohhh, the &ldquo;consciousness ==&gt; freedom&rdquo; frame is powerful. Serious Tim Urban / Religion for the Nonreligious vibes. Being conscious / aware of the fog is the first step in getting rid of it.<br />
</p>
</div>
</div>
<div id="outline-container-org8bb0eab" class="outline-3">
<h3 id="org8bb0eab"><a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/12consciousness.pdf#page=12">Consciousness is <i>constructed</i></a></h3>
<div class="outline-text-3" id="text-org8bb0eab">
<p>
from the intention to move, the illusion of movement, the actual movement, movement =&gt; proprioceptive feedback, movement =&gt; sensory input &#x2013; each of these has an associated brain area<br />
</p>
</div>
</div>
<div id="outline-container-orgbd36258" class="outline-3">
<h3 id="orgbd36258">Consciousness is unified</h3>
<div class="outline-text-3" id="text-orgbd36258">
<p>
Despite all these different processes, we feel it like one, unified <i>experience</i>. Corpus callosum: connects our two hemispheres. Other connections exist, tho, and if corpus callosum is cut, anterior and posterior commisures show larger volume<br />
</p>
</div>
</div>
