org/psych_50_cognitive_neuroscience.org
** Consciousness has neural correlates
Hypothesis: subset of visual neurons are related to conscious perception
** Consciousness is not an epiphenomenon
Seems to be some experimental evidence that intention arises before action...but it's not just "froth on the wave," it actually has a causal impact on the future.
** Consciousness has a function
Cue Newsome, become more aware/free?
* Dopamine System
:PROPERTIES:
:ID:       29c59046-14ef-4f6b-ba0e-8e56db7ef567
:END:
Good example of broadcast system in the brain: [[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 7 Study Guide_ Introduction to Cognitive Neuroscience.pdf::4++0.00][broadcasts signals far and wide]] in the brain.

broadcast: neurochemical signals that are sprayed widely over the brain. "Dopamine neurons" in the ventral-tegmental area and substantia nigra pars compacta. Striatum involved in value representation.

dopamine represents perceived /value/ (not pleasure) -- its signal serves as a measure of prediction error. Dopamine = wanting, not liking.

[[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 7 Study Guide_ Introduction to Cognitive Neuroscience.pdf::6++0.00][Pavlovian conditioning]]: stimulus (bell) becomes associated with reward (food.) Thus, the conditioned response (salivation) shifts /backward/ from the time of receiving reward to the time of receiving stimulus (can show causality b/c after conditioning, dogs salivate upon hearing the bell /even when no food is given/.).

drugs hijack dopamine circuitry, motivating drugseeking behavior.

Rescorla-Wagner: value of stimulus is updated by the *difference* between reward and the current value. (cf. gradient descent)
$V_{pred} += \alpha(R - V_{pred})$


TD learning: takes time into account (reward propagates backwards) further and further in time -- like a basic form of [[id:9c86eed7-06ae-4995-b87e-4784e696dd4d][reinforcement learning]]
$R_{t=n} - (V_{t=n} - V_{t=n+1})$ = 0
* [[id:7b9258d6-4548-4050-8e5d-b758a7f56b80][Memory]]
:PROPERTIES:
:ID:       a5c25295-9184-4df0-a4ac-5703afe74425
:END:
** Many Regions + Types of memory
Frontal Eye Field (FEF) is involved in working memory

[[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 8 Study Guide_ Introduction to Cognitive Neuroscience.pdf::6++0.00][Memory is many different things]] -- many different types of memory, different brain regions involved. Comment: This makes me think that memory is more of a property of neural circuits, rather than an isolated/specialized function.

Double dissociation = establishing separateness of certain kinds of memories by lesioning either area, and seeing the effects on memory tasks.

[[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 8 Study Guide_ Introduction to Cognitive Neuroscience.pdf::8++0.00][See this graph for double dissocation]] --
parietal lobe lesion in K.F. => impaired working memory, fine declarative memory
MTL removal in H.M. => impaired declarative memory, fine working memory

Parkinsons => impaired cognitive skill learning, fine declarative memory
MTL patients => impaired declarative memory, fine cognitive skill learning

Visual cortex damage => impaired perceptual priming, fine declarative memory
MTL ...

Amygdala damage => impaired fear conditioning, fine declarative memory
MTL ...
** Hippocampus (within MTL)
Very interesting brain structure. As seen from MTL damage, associated with declarative memory...

Hippocampus = memory formation/encoding, and then  cortex = long term storage?

Could perform [[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 8 Study Guide_ Introduction to Cognitive Neuroscience.pdf::18++0.00][pattern separation]] -- makes the pattern of activity for different activities as separate as possible (even if they look similar)

Also [[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 8 Study Guide_ Introduction to Cognitive Neuroscience.pdf::20++0.00][pattern completion]] -- pull in the whole pattern from just a part.

Interesting note about [[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 8 Study Guide_ Introduction to Cognitive Neuroscience.pdf::23++0.00][catastrophic interference]]. So basically hippocampus is for encoding memories separately and quickly, and neocortex is for building generalizations and long-term storage.

/All this talk about memory makes me think...what's the distinction between "data" and "code" in the brain? Like obviously some regions are devoted moreso to storing memories, and some to "code"...but wait yeah that's interesting, because in a sense it's ALL data, including code. It's all just bytes (or whatever it is in the brain, connection strengths??) But perhaps certain ways of "calling" that data, whenever the brain wants to activate a chunk of neurons, turns them into functions. Strong Lisp vibes here -- data and code blend together./
* Memory, Synapses, Long-Term Potentiation (LTP)
Going lower-level to the neuronal level ... how are new memories formed + consolidated synaptically?
** Neurogenesis
*Lots of neurogenesis in adults in hippocampus/striatum, and we don't know why.* Could be connected to memory/learning. Seems like a random addition to this section, and that's prob cuz the research is still developing LOL
** Hebbian plasticity
*could be a fundamental mechanism for learning*
= neurons that fire together, wire together. More concretely - synapses get stronger when pre- and post- synaptic activity is correlated.

*NMDA receptor* -- [[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 9 Study Guide_ Introduction to Cognitive Neuroscience.pdf::6++0.00][could underlie Hebbian plasticity]]. Allows for Ca2+ entry (=> protein synth => LTP) only when /both/ presynaptic and postsynaptic cell are depolarized.

/Meta: I'm using => as "leads to" in this case, but in other cases I use it as the mathematical implication operator. This could lead to some confusion...perhaps I should only use -> for mathematical implication?/
** Synapses
[[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 9 Study Guide_ Introduction to Cognitive Neuroscience.pdf::11++0.00][Synaptic consolidation requires protein synthesis]] -- ion channels (made of proteins) needed for activations.

Two types of synapses -- *electrical synapses* (gap junctions) and *chemical synapses*.

Electrical synapses (keep neurons in sync.)

Chemical synapses (neurons can behave differently ... passage of information / perception / thought??)
