html/psych_50_cognitive_neuroscience.html
<div id="outline-container-org7c1356b" class="outline-3">
<h3 id="org7c1356b">Consciousness has neural correlates</h3>
<div class="outline-text-3" id="text-org7c1356b">
<p>
Hypothesis: subset of visual neurons are related to conscious perception<br />
</p>
</div>
</div>
<div id="outline-container-org9e6c16a" class="outline-3">
<h3 id="org9e6c16a">Consciousness is not an epiphenomenon</h3>
<div class="outline-text-3" id="text-org9e6c16a">
<p>
Seems to be some experimental evidence that intention arises before action&#x2026;but it&rsquo;s not just &ldquo;froth on the wave,&rdquo; it actually has a causal impact on the future.<br />
</p>
</div>
</div>
<div id="outline-container-org367b144" class="outline-3">
<h3 id="org367b144">Consciousness has a function</h3>
<div class="outline-text-3" id="text-org367b144">
<p>
Cue Newsome, become more aware/free?<br />
</p>
</div>
</div>
</div>
<div id="outline-container-ID-29c59046-14ef-4f6b-ba0e-8e56db7ef567" class="outline-2">
<h2 id="ID-29c59046-14ef-4f6b-ba0e-8e56db7ef567">Dopamine System</h2>
<div class="outline-text-2" id="text-org14b6b72">
<p>
Good example of broadcast system in the brain: <a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 7 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=4">broadcasts signals far and wide</a> in the brain.<br />
</p>

<p>
broadcast: neurochemical signals that are sprayed widely over the brain. &ldquo;Dopamine neurons&rdquo; in the ventral-tegmental area and substantia nigra pars compacta. Striatum involved in value representation.<br />
</p>

<p>
dopamine represents perceived <i>value</i> (not pleasure) &#x2013; its signal serves as a measure of prediction error. Dopamine = wanting, not liking.<br />
</p>

<p>
<a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 7 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=6">Pavlovian conditioning</a>: stimulus (bell) becomes associated with reward (food.) Thus, the conditioned response (salivation) shifts <i>backward</i> from the time of receiving reward to the time of receiving stimulus (can show causality b/c after conditioning, dogs salivate upon hearing the bell <i>even when no food is given</i>.).<br />
</p>

<p>
drugs hijack dopamine circuitry, motivating drugseeking behavior.<br />
</p>

<p>
Rescorla-Wagner: value of stimulus is updated by the <b>difference</b> between reward and the current value. (cf. gradient descent)<br />
\(V_{pred} += \alpha(R - V_{pred})\)<br />
</p>


<p>
TD learning: takes time into account (reward propagates backwards) further and further in time &#x2013; like a basic form of <a href="private/20201005132132-reinforcement_learning.html#ID-9c86eed7-06ae-4995-b87e-4784e696dd4d">reinforcement learning</a><br />
\(R_{t=n} - (V_{t=n} - V_{t=n+1})\) = 0<br />
</p>
</div>
</div>
<div id="outline-container-ID-a5c25295-9184-4df0-a4ac-5703afe74425" class="outline-2">
<h2 id="ID-a5c25295-9184-4df0-a4ac-5703afe74425"><a href="private/20201005215940-memory.html#ID-7b9258d6-4548-4050-8e5d-b758a7f56b80">Memory</a></h2>
<div class="outline-text-2" id="text-org2d29160">
</div>
<div id="outline-container-orgbf7622f" class="outline-3">
<h3 id="orgbf7622f">Many Regions + Types of memory</h3>
<div class="outline-text-3" id="text-orgbf7622f">
<p>
Frontal Eye Field (FEF) is involved in working memory<br />
</p>

<p>
<a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 8 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=6">Memory is many different things</a> &#x2013; many different types of memory, different brain regions involved. Comment: This makes me think that memory is more of a property of neural circuits, rather than an isolated/specialized function.<br />
</p>

<p>
Double dissociation = establishing separateness of certain kinds of memories by lesioning either area, and seeing the effects on memory tasks.<br />
</p>

<p>
<a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 8 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=8">See this graph for double dissocation</a> &#x2013;<br />
parietal lobe lesion in K.F. =&gt; impaired working memory, fine declarative memory<br />
MTL removal in H.M. =&gt; impaired declarative memory, fine working memory<br />
</p>

<p>
Parkinsons =&gt; impaired cognitive skill learning, fine declarative memory<br />
MTL patients =&gt; impaired declarative memory, fine cognitive skill learning<br />
</p>

<p>
Visual cortex damage =&gt; impaired perceptual priming, fine declarative memory<br />
MTL &#x2026;<br />
</p>

<p>
Amygdala damage =&gt; impaired fear conditioning, fine declarative memory<br />
MTL &#x2026;<br />
</p>
</div>
</div>
<div id="outline-container-org49efdb3" class="outline-3">
<h3 id="org49efdb3">Hippocampus (within MTL)</h3>
<div class="outline-text-3" id="text-org49efdb3">
<p>
Very interesting brain structure. As seen from MTL damage, associated with declarative memory&#x2026;<br />
</p>

<p>
Hippocampus = memory formation/encoding, and then  cortex = long term storage?<br />
</p>

<p>
Could perform <a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 8 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=18">pattern separation</a> &#x2013; makes the pattern of activity for different activities as separate as possible (even if they look similar)<br />
</p>

<p>
Also <a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 8 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=20">pattern completion</a> &#x2013; pull in the whole pattern from just a part.<br />
</p>

<p>
Interesting note about <a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 8 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=23">catastrophic interference</a>. So basically hippocampus is for encoding memories separately and quickly, and neocortex is for building generalizations and long-term storage.<br />
</p>

<p>
<i>All this talk about memory makes me think&#x2026;what&rsquo;s the distinction between &ldquo;data&rdquo; and &ldquo;code&rdquo; in the brain? Like obviously some regions are devoted moreso to storing memories, and some to &ldquo;code&rdquo;&#x2026;but wait yeah that&rsquo;s interesting, because in a sense it&rsquo;s ALL data, including code. It&rsquo;s all just bytes (or whatever it is in the brain, connection strengths??) But perhaps certain ways of &ldquo;calling&rdquo; that data, whenever the brain wants to activate a chunk of neurons, turns them into functions. Strong Lisp vibes here &#x2013; data and code blend together.</i><br />
</p>
</div>
</div>
</div>
<div id="outline-container-org4141acd" class="outline-2">
<h2 id="org4141acd">Memory, Synapses, Long-Term Potentiation (LTP)</h2>
<div class="outline-text-2" id="text-org4141acd">
<p>
Going lower-level to the neuronal level &#x2026; how are new memories formed + consolidated synaptically?<br />
</p>
</div>
<div id="outline-container-orgd3a147b" class="outline-3">
<h3 id="orgd3a147b">Neurogenesis</h3>
<div class="outline-text-3" id="text-orgd3a147b">
<p>
<b>Lots of neurogenesis in adults in hippocampus/striatum, and we don&rsquo;t know why.</b> Could be connected to memory/learning. Seems like a random addition to this section, and that&rsquo;s prob cuz the research is still developing LOL<br />
</p>
</div>
</div>
<div id="outline-container-orgf200427" class="outline-3">
<h3 id="orgf200427">Hebbian plasticity</h3>
<div class="outline-text-3" id="text-orgf200427">
<p>
<b>could be a fundamental mechanism for learning</b><br />
= neurons that fire together, wire together. More concretely - synapses get stronger when pre- and post- synaptic activity is correlated.<br />
</p>

<p>
<b>NMDA receptor</b> &#x2013; <a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 9 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=6">could underlie Hebbian plasticity</a>. Allows for Ca2+ entry (=&gt; protein synth =&gt; LTP) only when <i>both</i> presynaptic and postsynaptic cell are depolarized.<br />
</p>

<p>
<i>Meta: I&rsquo;m using =&gt; as &ldquo;leads to&rdquo; in this case, but in other cases I use it as the mathematical implication operator. This could lead to some confusion&#x2026;perhaps I should only use -&gt; for mathematical implication?</i><br />
</p>
</div>
</div>
<div id="outline-container-org8f03d11" class="outline-3">
<h3 id="org8f03d11">Synapses</h3>
<div class="outline-text-3" id="text-org8f03d11">
<p>
<a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 9 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=11">Synaptic consolidation requires protein synthesis</a> &#x2013; ion channels (made of proteins) needed for activations.<br />
</p>

<p>
Two types of synapses &#x2013; <b>electrical synapses</b> (gap junctions) and <b>chemical synapses</b>.<br />
</p>

<p>
Electrical synapses (keep neurons in sync.)<br />
</p>

<p>
Chemical synapses (neurons can behave differently &#x2026; passage of information / perception / thought??)<br />
</p>
</div>
</div>
</div>
