org/psych_50_cognitive_neuroscience.org
* Spatial Cognition
:PROPERTIES:
:ID:       293a2e12-7da7-49b2-9e54-718a5a89ed58
:END:
*Place cells* in hippocampus fire for location
*Grid cells* fire regularly depending on where you are in a locale
*direction cells* = a sort of mental, locale-local compass.
*border cells* = detect borders of an environment
* Emotion
[[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 10 Study Guide_ Introduction to Cognitive Neuroscience.pdf::4++0.00][Oxytocin <=> pair bonding]] (for females)
increase in trusting behaviors for humans w/ oxytocin inhaled (well...maybe)

[[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 10 Study Guide_ Introduction to Cognitive Neuroscience.pdf::5++0.00][toxoplasmosis]] -- holy crap that's creepy. Mice eat cat poop infected with toxoplasma => become unafraid of cat urine => get eaten by cats => infect another cat with toxoplasma. (Reason: toxoplasma affects/damages the amygdala)

Kluver-Bucy syndrome: loss of fear reactions.

*Endocrine system* also controls emotions. A bunch of hormones in the pituitary gland => stress, pain, reproductive functions, mating behaviors lol...

*Autonomic nervous system*: control bodily responses.
- Sympathetic system uses norepinephrine (adrenaline) for fight-or-flight signaling
- Parasympathetic system uses acetylcholine for rest-and-digest signaling

Rabies: virus that takes over central nervous system, makes behavior more aggressive/salivating (perfect for transmission to others). So efficient at spreading through nervous system that scientists use it to trace neural connections(!)

Enteric nervous system: the gut practically has a mind of its own (lots of neurons down there.) Interesting bit -- some bacteria might be producing serotonin + hijacking the enteric system...

Somatic marker hypothesis: instead of emotions => bodily response, bodily response => emotions. see [[pdf:~/Desktop/Misc./Old Classes/PSYCH 50/Week 10 Study Guide_ Introduction to Cognitive Neuroscience.pdf::13++0.00][Iowa gambling task]]: people have a "skin conductance response" whenever hovering over a bad deck, as a bodily "marker" that influences emotion / decision making. (Interesting -- we think with our bodies??)
* Social Cognition + Autism
[[https://www.youtube.com/watch?v=VTNmLt7QX8E][video of random shapes moving around]] -- but the (neurotypical) brain sees a social scene, the big triangle bullying the others, the lil circle and square dancing(?) and maybe even in love(?). autistic doesn't see the social construction -- just sees literally.

Neurotypicals' and Autistics' eye patterms are different too -- autistics care less about faces and eyes, social cues, etc.

Theory of mind = theory theory = our ability to reason about others' mental states. Develops in childhood (Remember that whole Mary and Sally story...)

Genes + environment => Autism.
* Brain-machine interfaces
Currently, can just replace sensory organs (and kinda badly.) Future...interface with cognitive parts of brain? Cortex? Cue Neuralink
