html/psych_50_cognitive_neuroscience.html
<div id="outline-container-ID-293a2e12-7da7-49b2-9e54-718a5a89ed58" class="outline-2">
<h2 id="ID-293a2e12-7da7-49b2-9e54-718a5a89ed58">Spatial Cognition</h2>
<div class="outline-text-2" id="text-orga5dd8c6">
<p>
<b>Place cells</b> in hippocampus fire for location<br />
<b>Grid cells</b> fire regularly depending on where you are in a locale<br />
<b>direction cells</b> = a sort of mental, locale-local compass.<br />
<b>border cells</b> = detect borders of an environment<br />
</p>
</div>
</div>
<div id="outline-container-org19e81d9" class="outline-2">
<h2 id="org19e81d9">Emotion</h2>
<div class="outline-text-2" id="text-org19e81d9">
<p>
<a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 10 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=4">Oxytocin &lt;=&gt; pair bonding</a> (for females)<br />
increase in trusting behaviors for humans w/ oxytocin inhaled (well&#x2026;maybe)<br />
</p>

<p>
<a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 10 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=5">toxoplasmosis</a> &#x2013; holy crap that&rsquo;s creepy. Mice eat cat poop infected with toxoplasma =&gt; become unafraid of cat urine =&gt; get eaten by cats =&gt; infect another cat with toxoplasma. (Reason: toxoplasma affects/damages the amygdala)<br />
</p>

<p>
Kluver-Bucy syndrome: loss of fear reactions.<br />
</p>

<p>
<b>Endocrine system</b> also controls emotions. A bunch of hormones in the pituitary gland =&gt; stress, pain, reproductive functions, mating behaviors lol&#x2026;<br />
</p>

<p>
<b>Autonomic nervous system</b>: control bodily responses.<br />
</p>
<ul class="org-ul">
<li>Sympathetic system uses norepinephrine (adrenaline) for fight-or-flight signaling<br /></li>
<li>Parasympathetic system uses acetylcholine for rest-and-digest signaling<br /></li>
</ul>

<p>
Rabies: virus that takes over central nervous system, makes behavior more aggressive/salivating (perfect for transmission to others). So efficient at spreading through nervous system that scientists use it to trace neural connections(!)<br />
</p>

<p>
Enteric nervous system: the gut practically has a mind of its own (lots of neurons down there.) Interesting bit &#x2013; some bacteria might be producing serotonin + hijacking the enteric system&#x2026;<br />
</p>

<p>
Somatic marker hypothesis: instead of emotions =&gt; bodily response, bodily response =&gt; emotions. see <a href="file:///Users/ketanagrawal/Desktop/Misc./Old Classes/PSYCH 50/Week 10 Study Guide_ Introduction to Cognitive Neuroscience.pdf#page=13">Iowa gambling task</a>: people have a &ldquo;skin conductance response&rdquo; whenever hovering over a bad deck, as a bodily &ldquo;marker&rdquo; that influences emotion / decision making. (Interesting &#x2013; we think with our bodies??)<br />
</p>
</div>
</div>
<div id="outline-container-org201926a" class="outline-2">
<h2 id="org201926a">Social Cognition + Autism</h2>
<div class="outline-text-2" id="text-org201926a">
<p>
<a href="https://www.youtube.com/watch?v=VTNmLt7QX8E">video of random shapes moving around</a> &#x2013; but the (neurotypical) brain sees a social scene, the big triangle bullying the others, the lil circle and square dancing(?) and maybe even in love(?). autistic doesn&rsquo;t see the social construction &#x2013; just sees literally.<br />
</p>

<p>
Neurotypicals&rsquo; and Autistics&rsquo; eye patterms are different too &#x2013; autistics care less about faces and eyes, social cues, etc.<br />
</p>

<p>
Theory of mind = theory theory = our ability to reason about others&rsquo; mental states. Develops in childhood (Remember that whole Mary and Sally story&#x2026;)<br />
</p>

<p>
Genes + environment =&gt; Autism.<br />
</p>
</div>
</div>
<div id="outline-container-orgb616ac6" class="outline-2">
<h2 id="orgb616ac6">Brain-machine interfaces</h2>
<div class="outline-text-2" id="text-orgb616ac6">
<p>
Currently, can just replace sensory organs (and kinda badly.) Future&#x2026;interface with cognitive parts of brain? Cortex? Cue Neuralink<br />
</p>
</div>
</div>


<div id="outline-container-orgd8cccba" class="outline-2 references">
<h2 id="orgd8cccba">Links to &ldquo;PSYCH 50: Cognitive Neuroscience&rdquo;</h2>
<div class="outline-text-2" id="text-orgd8cccba">
</div>
<div id="outline-container-org9999e66" class="outline-3">
<h3 id="org9999e66"><a href="course_notes.html#ID-6d2c6f5c-f8c1-4b38-a01a-6adcdbfe8e7a">📒 course notes</a></h3>
<div class="outline-text-3" id="text-org9999e66">
<p>
Some notes for select courses that I took in my time at Stanford!<br />
<a href="social_psychology.html#ID-3db1ed04-4b29-46cf-9940-1afd30d5d25f">Social Psychology</a><br />
<a href="cs144_introduction_to_computer_networking.html#ID-9908ac8d-fadd-4fe6-a78c-c3471cc36ea1">Computer Networking</a><br />
<a href="cs224u_natural_language_understanding.html#ID-4785205d-bb3f-4795-9b13-7bc8128e3ae0">CS224u: Natural Language Understanding</a><br />
<a href="psych_50_cognitive_neuroscience.html#ID-543215d5-6bd3-423c-98a9-8374b7e26894">PSYCH 50: Cognitive Neuroscience</a><br />
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
  <p>Made with <span class="heart">♥</span> using
    <a href="https://orgmode.org/">org-mode</a>.
    Source code is available
    <a href="https://github.com/ketan0/digital-laboratory">here</a>.
  </p>
</footer>
<script src="popper.min.js"></script>
<script src="tippy-bundle.umd.min.js"></script>
<script src="tooltips.js"></script>
<script src="setup-theme-switcher.js"></script>
<script src="insert-intext-citation.js"></script>
</div>
</body>
</html>
